In [1]:
import pandas as pd

In [2]:
path = "/home/aman/Documents/eurekaGurus/Result/Final Responses/Slot 2/"

In [3]:
df1 = pd.read_csv(path + "Class11.csv")
df2 = pd.read_csv(path + "Class12.csv")
#df3 = pd.read_csv(path + "Class10.csv")

In [4]:
df1.head()

,Roll Number,Subject,1,2,3,4,5,6,7,8,...,N1,N2,N3,N4,N5,N6,N7,N8,N9,N10
0,UK2001-11-001,Maths,B,NaN,NaN,D,B,A,C,A,...,A,A,NaN,NaN,B,B,C,C,NaN,B
1,UK2001-11-009,Maths,A,D,C,D,B,A,C,A,...,C,A,A,A,NaN,D,C,B,B,C
2,MH2002-11-001,Biology,B,C,C,A,B,A,D,A,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,HP2002-11-001,Maths,C,D,C,D,B,A,D,B,...,A,C,B,C,B,B,C,B,C,C
4,HP2002-11-002,Maths,B,C,B,D,C,A,B,A,...,D,D,C,A,C,B,C,A,C,B

In [5]:
df1 = df1.drop(['Subject', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31', '32', '33', '34', '35'], axis = 1)
df2 = df2.drop(['Subject', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31', '32', '33', '34', '35'], axis = 1)
#df3 = df3.drop(['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31', '32', '33', '34', '35'], axis = 1)

In [6]:
df1.head()

     Roll Number   N1   N2   N3   N4   N5   N6   N7   N8   N9  N10
0  UK2001-11-001    A    A  NaN  NaN    B    B    C    C  NaN    B
1  UK2001-11-009    C    A    A    A  NaN    D    C    B    B    C
2  MH2002-11-001  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3  HP2002-11-001    A    C    B    C    B    B    C    B    C    C
4  HP2002-11-002    D    D    C    A    C    B    C    A    C    B

In [7]:
df2.head()

     Roll Number N1   N2   N3   N4   N5   N6   N7   N8   N9  N10
0  KA2001-12-001  B    B    A  NaN  NaN    B  NaN  NaN  NaN  NaN
1  UK2001-12-003  A    B    D    C    A    A    C    C    A    A
2  UK2001-12-001  D    B  NaN  NaN  NaN  NaN    D    C    C    A
3  UK2001-12-002  B  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4  UK2001-12-004  B    B    A    D    B    B    C    D    B    A

In [8]:
#df3.head()

In [9]:
len(df1)

38

In [10]:
len(df2)

10

In [11]:
#len(df3)

In [12]:
df = df1.append(df2)

In [13]:
#df = df.append(df3)

In [14]:
len(df)

48

In [15]:
df.to_csv(path + "Category2.csv")